{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "irrelevant",
    "1": "system",
    "2": "source",
    "3": "faultdescription",
    "4": "servicerequest",
    "5": "other"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "faultdescription": "3",
    "irrelevant": "0",
    "other": "5",
    "servicerequest": "4",
    "source": "2",
    "system": "1"
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.24.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
